#+title: A genome-wide perspective on the history of the British Isles
#+author: Dan, Chris, Garrett, Peter et al.

** Org
#+babel:    :dir /davison@oak.well.ox.ac.uk:~/bench
#+options: ^:{}

#+begin_src emacs-lisp :cache no
  (setq org-babel-default-header-args:R '((:session . "*R-PoBI*")))
#+end_src

#+results:
| (:session . *R-PoBI*) |

** Select countries
#+tblname: include-countries
| Country |    n |
|---------+------|
| Belgium |  566 |
| Denmark |  363 |
| France  |  536 |
| Germany | 1166 |
| Ireland |   73 |
| Italy   |  776 |
| Norway  | 1030 |
| Poland  |   59 |
| Spain   |  211 |
| Sweden  | 1401 |

#+begin_src R :var include.countries=include-countries :rownames yes :colnames yes
  include.countries <- rownames(include.countries)
  MSindivs$include <- MSindivs$country %in% include.countries
  system("mkdir -p data/MS/exclusions")
  cat(rownames(MSindivs)[!MSindivs$include], file="data/MS/exclusions/country-exclusions", sep="\n")
  table(MSindivs$country, MSindivs$include)
#+end_src

#+results:
|            | FALSE | TRUE |
|------------+-------+------|
| Australia  |   705 |    0 |
| Belgium    |     0 |  566 |
| Denmark    |     0 |  363 |
| FIN        |   652 |    0 |
| France     |     0 |  536 |
| Germany    |     0 | 1166 |
| Ireland    |     0 |   73 |
| Italy      |     0 |  776 |
| NewZealand |   156 |    0 |
| Norway     |     0 | 1030 |
| Poland     |     0 |   59 |
| Spain      |     0 |  211 |
| Sweden     |     0 | 1401 |
| UK         |  2048 |    0 |
| USA        |  1634 |    0 |

** Exclusions

#+begin_src sh
cat data/MS/exclusions/* | sort | uniq > data/MS/exclusions.all
#+end_src

#+begin_src sh :session none
wc -l data/MS/exclusions/*
echo $(cat data/MS/exclusions/* | sort | uniq | wc -l) unique
wc -l data/MS/exclusions.all
#+end_src

#+results:
|  910 | data/MS/exclusions/MSInternalExclusions.dan.txt |
| 5195 | data/MS/exclusions/country-exclusions           |
| 6105 | total                                           |
| 5565 | unique                                          |
| 5565 | data/MS/exclusions.all                          |
** Sample numbers

- PoBI+MS id files have 7924 individs
- Raw files and exclusion files suggest there should be 8233 in PoBI+MS.
- Data files have 8267

  #+begin_src R :results output
  system(paste("~/bin/numindivs-gen", datafile("22", "w")))
  #+end_src


|       | PoBI |    MS | PoBI+MS |
|-------+------+-------+---------|
| all   | 2912 | 11376 |         |
| ex    |  368 |  5687 |         |
| final | 2544 |  5689 |    8233 |
#+TBLFM: @4$4=@4$2+@4$3
#+TBLFM: @4$3=@2$3-@3$3
#+TBLFM: @4$2=@2$2-@3$2

#+begin_src sh
wc -l data/POBI+MS/*-allx.ids
#+end_src

#+results:
|   7924 | data/POBI+MS/01-allx.ids |
|   7924 | data/POBI+MS/02-allx.ids |
|   7924 | data/POBI+MS/03-allx.ids |
|   7924 | data/POBI+MS/04-allx.ids |
|   7924 | data/POBI+MS/05-allx.ids |
|   7924 | data/POBI+MS/06-allx.ids |
|   7924 | data/POBI+MS/07-allx.ids |
|   7924 | data/POBI+MS/08-allx.ids |
|   7924 | data/POBI+MS/09-allx.ids |
|   7924 | data/POBI+MS/10-allx.ids |
|   7924 | data/POBI+MS/11-allx.ids |
|   7924 | data/POBI+MS/12-allx.ids |
|   7924 | data/POBI+MS/13-allx.ids |
|   7924 | data/POBI+MS/14-allx.ids |
|   7924 | data/POBI+MS/15-allx.ids |
|   7924 | data/POBI+MS/16-allx.ids |
|   7924 | data/POBI+MS/17-allx.ids |
|   7924 | data/POBI+MS/18-allx.ids |
|   7924 | data/POBI+MS/19-allx.ids |
|   7924 | data/POBI+MS/20-allx.ids |
|   7924 | data/POBI+MS/21-allx.ids |
|   7924 | data/POBI+MS/22-allx.ids |
| 174328 | total                    |

***** DONE Numbers
#+begin_example
echo num lines: `grep -vF NA 22-MS.wNA.xidx | sort -n | wc -l`
num lines: 5687
grep -vF NA 22-MS.wNA.xidx | sort -n > 22-MS.xidx
columns -s -v -f 22-MS.xidx < 22-MSr.gen > 22-MSx.gen
sed 1,2d /data/oak/project/wtccc2/MS/illumina/calls/MS_illumina.sample | cut -d ' ' -f 1 | slice -v --line-file 22-MS.xidx > 22-MSx.ids
mv 22-MSr.sample 22-MSx.sample
#+end_example

So 5687 should have been removed from MS, leaving us with 11376-5687 = 5689

Which is correct. The problem is the 5288 in 22-MSx.ids

#+begin_src sh
echo -n "To_exclude "
wc -l 22-MS.xids

echo -n "Indices_to_be_excluded "
wc -l 22-MS.wNA.xidx

echo -n "Indices_to_be_excluded_wo_NA "
wc -l 22-MS.xids

echo -n "Included_IDs "
wc -l 22-MSx.ids

echo -n "Num_indivs_in_gen_file "
~/bin/numindivs-gen 22-MSx.gen
#+end_src

#+results:
| To_exclude                   | 5688 | 22-MS.xids     |
| Indices_to_be_excluded       | 5688 | 22-MS.wNA.xidx |
| Indices_to_be_excluded_wo_NA | 5688 | 22-MS.xids     |
| Included_IDs                 | 5689 | 22-MSx.ids     |
| Num_indivs_in_gen_file       | 5689 |                |

#+begin_src R
5688*3
#+end_src

#+results:
: 17064

***** DONE Numbers
#+begin_example
grep -vF NA 22-POBI.wNA.xidx | sort -n > 22-POBI-tmp && mv 22-POBI-tmp 22-POBI.xidx
columns -s -v -f 22-POBI.xidx < 22-POBIr.gen > 22-POBIx.gen
sed 1,2d /data/oak/project/wtccc2/POBI/illumina/calls/POBI_illumina.sample | cut -d ' ' -f 1 | slice -v --line-file 22-POBI.xidx > 22-POBIx.ids
mv 22-POBIr.sample 22-POBIx.sample
#+end_example

So 334 should have been removed from POBI, leaving us with src_R{2912-334} = 2578.

#+begin_src sh
~/bin/numindivs-gen 22-POBIx.gen
wc -l 22-POBIx.ids
#+end_src

#+results:
| 2578 |              |
| 2578 | 22-POBIx.ids |

*** Combine across cohorts
#+begin_example 
Combining data across cohorts

cut -d ' ' -f 1-5 < 22-MSx.gen > 22-MSx.map
cut -d ' ' -f 6- < 22-MSx.gen > 22-MSx.gen_only
cut -d ' ' -f 1-5 < 22-POBIx.gen > 22-POBIx.map
cut -d ' ' -f 6- < 22-POBIx.gen > 22-POBIx.gen_only
paste -d ' ' 22-MSx.gen 22-POBIx.gen_only > 22-allx.gen
cat 22-MSx.ids 22-POBIx.ids > 22-allx.ids
#+end_example

Total should be src_R{5689+2578}=8267

#+begin_src sh
~/bin/numindivs-gen 22-allx.gen
wc -l *.ids
#+end_src

#+results:
|  8267 |              |
|  5288 | 22-MSx.ids   |
|  2636 | 22-POBIx.ids |
|  7924 | 22-allx.ids  |
| 15848 | total        |

** DONE Check restricted data dimensions

#+begin_src sh :colnames yes
  printf "chr\thapmap-L\twtccc2-L\thapmap-n\twtccc2-n\n"
  for i in `seq -w 1 22` ; do
      h=rdata/h-$i.hap
      w=rdata/w-$i.gen
      printf "%02d\t%d\t%d\t%d\t%d\n" \
          $i \
          `wc -l < $h` \
          `wc -l < $w` \
          `head -n1 $h | wc | awk '{print $2}'` \
          `~/bin/numindivs-gen $w`
  done
#+end_src

#+results:
| chr | hapmap-L | wtccc2-L | hapmap-n | wtccc2-n |
|   1 |    38977 |    38977 |      410 |     8267 |
|   2 |    41420 |    41420 |      410 |     8267 |
|   3 |    34441 |    34441 |      410 |     8267 |
|   4 |    30084 |    30084 |      410 |     8267 |
|   5 |    31185 |    31185 |      410 |     8267 |
|   6 |    33177 |    33177 |      410 |     8267 |
|   7 |    27372 |    27372 |      410 |     8267 |
|   0 |    28491 |    28491 |      410 |     8267 |
|   0 |    24386 |    24386 |      410 |     8267 |
|  10 |    26922 |    26922 |      410 |     8267 |
|  11 |    24865 |    24865 |      410 |     8267 |
|  12 |    24696 |    24696 |      410 |     8267 |
|  13 |    18973 |    18973 |      410 |     8267 |
|  14 |    16758 |    16758 |      410 |     8267 |
|  15 |    15284 |    15284 |      410 |     8267 |
|  16 |    15627 |    15627 |      410 |     8267 |
|  17 |    13338 |    13338 |      410 |     8267 |
|  18 |    15224 |    15224 |      410 |     8267 |
|  19 |     8656 |     8656 |      410 |     8267 |
|  20 |    13139 |    13139 |      410 |     8267 |
|  21 |     7475 |     7475 |      410 |     8267 |
|  22 |     7635 |     7635 |      410 |     8267 |

*** Flip WTCCC2 PoBI+MS
#+source: create-flipped-files
#+begin_src R
  for(c in rev(chroms)) {
    cmd <- sprintf("%s/%s -i %s -n %02d < %s > %s",
                   PATH, "flipgen",
                   flipindfile(c, "w"),
                   nwtccc2,
                   rdatafile(c, "w"),
                   frdatafile(c, "w"))
    print(cmd)
    system(cmd)
  
    cmd <- sprintf("ln -fs $PWD/%s %s", rdatafile(c, "h"), frdatafile(c, "h"))
    print(cmd)
    system(cmd)
  }
#+end_src

#+results: create-flipped-files
: 0

#+results:
: 0

*** DONE Flip indicators
#+begin_src sh
  wc -l flipind/*
#+end_src

#+results:
|  38977 | flipind/w-01.flip |
|  41420 | flipind/w-02.flip |
|  34441 | flipind/w-03.flip |
|  30084 | flipind/w-04.flip |
|  31185 | flipind/w-05.flip |
|  33177 | flipind/w-06.flip |
|  27372 | flipind/w-07.flip |
|  28491 | flipind/w-08.flip |
|  24386 | flipind/w-09.flip |
|  26922 | flipind/w-10.flip |
|  24865 | flipind/w-11.flip |
|  24696 | flipind/w-12.flip |
|  18973 | flipind/w-13.flip |
|  16758 | flipind/w-14.flip |
|  15284 | flipind/w-15.flip |
|  15627 | flipind/w-16.flip |
|  13338 | flipind/w-17.flip |
|  15224 | flipind/w-18.flip |
|   8656 | flipind/w-19.flip |
|  13139 | flipind/w-20.flip |
|   7475 | flipind/w-21.flip |
|   7635 | flipind/w-22.flip |
| 498125 | total             |

*** DONE Flipped data
#+begin_src sh :colnames yes
  printf "chr\thapmap-L\twtccc2-L\thapmap-n\twtccc2-n\n"
  for i in `seq -w 1 22` ; do
      h=frdata/h-$i.hap
      w=frdata/w-$i.gen
      printf "%02d\t%d\t%d\t%d\t%d\n" \
          $i \
          `wc -l < $h` \
          `wc -l < $w` \
          `head -n1 $h | wc | awk '{print $2}'` \
          `~/bin/numindivs-gen $w`
  done
#+end_src

#+results:
| chr | hapmap-L | wtccc2-L | hapmap-n | wtccc2-n |
|   1 |    38977 |    38977 |      410 |     8267 |
|   2 |    41420 |    41420 |      410 |     8267 |
|   3 |    34441 |    34441 |      410 |     8267 |
|   4 |    30084 |    30084 |      410 |     8267 |
|   5 |    31185 |    31185 |      410 |     8267 |
|   6 |    33177 |    33177 |      410 |     8267 |
|   7 |    27372 |    27372 |      410 |     8267 |
|   0 |    28491 |    28491 |      410 |     8267 |
|   0 |    24386 |    24386 |      410 |     8267 |
|  10 |    26922 |    26922 |      410 |     8267 |
|  11 |    24865 |    24865 |      410 |     8267 |
|  12 |    24696 |    24696 |      410 |     8267 |
|  13 |    18973 |    18973 |      410 |     8267 |
|  14 |    16758 |    16758 |      410 |     8267 |
|  15 |    15284 |    15284 |      410 |     8267 |
|  16 |    15627 |    15627 |      410 |     8267 |
|  17 |    13338 |    13338 |      410 |     8267 |
|  18 |    15224 |    15224 |      410 |     8267 |
|  19 |     8656 |     8656 |      410 |     8267 |
|  20 |    13139 |    13139 |      410 |     8267 |
|  21 |     7475 |     7475 |      410 |     8267 |
|  22 |     7635 |     7635 |      410 |     8267 |

Was:

| chr | hapmap-L | wtccc2-L | hapmap-n | wtccc2-n |
|   1 |    38977 |    38977 |      410 |     8267 |
|   2 |    41420 |    30687 |      410 |     8267 |
|   3 |    34441 |    34441 |      410 |     8267 |
|   4 |    30084 |    30084 |      410 |     8267 |
|   5 |    31185 |    31185 |      410 |     8267 |
|   6 |    33177 |    33177 |      410 |     8267 |
|   7 |    27372 |    27372 |      410 |     8267 |
|   0 |    28491 |    28491 |      410 |     8267 |
|   0 |    24386 |    24386 |      410 |     8267 |
|  10 |    26922 |    26922 |      410 |     8267 |
|  11 |    24865 |    24865 |      410 |     8267 |
|  12 |    24696 |    24696 |      410 |     8267 |
|  13 |    18973 |    18973 |      410 |     8267 |
|  14 |    16758 |    16758 |      410 |     8267 |
|  15 |    15284 |    15284 |      410 |     8267 |
|  16 |    15627 |    15433 |      410 |     8267 |
|  17 |    13338 |    13338 |      410 |     8267 |
|  18 |    15224 |    15224 |      410 |     8267 |
|  19 |     8656 |     8656 |      410 |     8267 |
|  20 |    13139 |     5776 |      410 |     8267 |
|  21 |     7475 |     7475 |      410 |     8267 |
|  22 |     7635 |     7635 |      410 |     8267 |

** DONE Check allele frequencies
#+begin_src R
  freq <- lapply(chroms, list)
  for(c in rev(chroms)) {
      nh <- 1910 ## 410
      ## Read in hapmap haplotypes in intersection
      freq[[c]]$h <- 1 - colMeans(matrix(scan(frdatafile(c, "h"), what=integer()), nrow=nh))
      cat(freq[[c]]$h, sep="\n", file=freqfile(c,"h"))
      
      ## Create w freq file
      cmd <- sprintf("%s/sstat -p -n %d < %s > %s",
                     PATH, nwtccc2, frdatafile(c,"w"), freqfile(c,"w"))
      print(cmd)
      system(cmd)
      freq[[c]]$w <- 1 - scan(freqfile(c,"w"))
      cat(freq[[c]]$w, sep="\n", file=freqfile(c,"w"))   
  
      png(file=sprintf("img/%s-freqs.png", c))
      plot(freq[[c]]$h, freq[[c]]$w, xlab="HapMap3",ylab="PoBI+MS")
      dev.off()
  }
#+end_src

#+results:
| 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 | 10 | 11 | 12 | 13 | 14 | 15 | 16 | 17 | 18 | 19 | 20 | 21 | 22 |

Functions to compute frequency of allele 0
#+begin_src R
  wfrequency <- function(c, i) {
      w <- scan(pipe(sprintf("sed -n -e %dp -e %dq < %s",
                             i, i, rdatafile(c, "w"))),
                quiet=TRUE, what="")
      wg <- matrix(as.numeric(w[6:length(w)]), nrow=3)
      mean(t(2:0) %*% wg) / 2
  }
  
  hfrequency <- function(c, i)
      1 - mean(scan(pipe(sprintf("sed -n -e %dp -e %dq < %s",
                                 i, i, rdatafile(c, "h"))),
                    quiet=TRUE, what=integer()))
#+end_src
** Babel script
#+begin_src R :noweb yes
  <<set-variables()>>
  <<set-up-data-frames()>>
  <<create-isect()>>
  <<create-restricted-files()>>
  <<create-flip-indicator-files()>>
  <<create-flipped-files()>>
#+end_src

#+results:
: 0

* TODO Sample lists

  POBI+MS files have 8267 individuals

  #+begin_src R :results output
  system(paste("~/bin/numindivs-gen", datafile("22", "w")))
  
  system("wc -l 22-MSx.ids")
  #+end_src

  #+results:
  : head: cannot open `data/POBI+MS/22-allx.gen' for reading: No such file or directory
  : -1
  : wc: 22-MS.ids: No such file or directory

* Synchronise
#+begin_src sh :results output
  rsync -auvz --delete data/MS/ $cetus:data/MS/ && rsync -auvz --delete data/MS/ $oak:data/MS/
#+end_src

#+results:
: building file list ... done
: 
: sent 314 bytes  received 20 bytes  668.00 bytes/sec
: total size is 612863  speedup is 1834.92
: sending incremental file list
: 
: sent 284 bytes  received 13 bytes  198.00 bytes/sec
: total size is 612863  speedup is 2063.51

# Local Variables=
# org-babel-default-header-args:R=((:session . "*R-PoBI*"))
# End=
